PH_data/alpha_1.25/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
21771
(
( 2.51819547e-05 -8.053341844e-06 -2.368170158e-07 1.704140959e-05 -1.052440979e-07 2.157438576e-05 )
( 2.482737364e-05 -7.876280506e-06 -3.085810647e-07 1.659346708e-05 -9.880886864e-08 2.15307391e-05 )
( 2.434750604e-05 -7.186811672e-06 -3.278970269e-07 1.591584805e-05 -1.198393704e-07 2.166092963e-05 )
( 2.401120946e-05 -7.029048447e-06 -3.9303319e-07 1.545755731e-05 -8.971908727e-08 2.170584594e-05 )
( 2.438705997e-05 -7.712849765e-06 -3.860713207e-07 1.610563595e-05 -7.4933169e-08 2.161948942e-05 )
( 2.344402674e-05 -6.096243396e-06 -3.140755496e-07 1.4278653e-05 -1.348495289e-07 2.180917181e-05 )
( 2.313610094e-05 -5.960124781e-06 -4.017238666e-07 1.381850416e-05 -9.995619621e-08 2.193368891e-05 )
( 2.352133015e-05 -6.849962574e-06 -4.724765006e-07 1.490624163e-05 -5.243066425e-08 2.189674706e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
