PH_data/alpha_1.25/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
21771
(
( 0.01378882676 0.0009245031979 -1.563723345e-06 )
( 0.01375989895 0.001148888725 3.727167041e-06 )
( 0.01332444884 0.0008932155324 2.286883864e-05 )
( 0.01328621339 0.001111217192 2.969783782e-05 )
( 0.01372560114 0.001420409186 1.296468508e-05 )
( 0.01278765593 0.0008396066842 5.541283099e-05 )
( 0.01272533741 0.001047133701 6.286283315e-05 )
( 0.01321653649 0.001372296945 4.182736666e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
